# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Abad_Sethi\Desktop\AbadPxl\2-EAI\Project_Onderzoek\Autonomous_Cart\AutonomousCart\RFID_Reader_PSOC.cydsn\RFID_Reader_PSOC.cyprj
# Date: Mon, 30 Mar 2020 13:23:53 GMT
#set_units -time ns
create_clock -name {I2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_2(FFB)} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_1(FFB)} -period 2208.333333333333 -waveform {0 1104.16666666667} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 241 481} [list]
create_generated_clock -name {SPI_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 121 241} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 2208.333333333333 [list]


# Component constraints for C:\Users\Abad_Sethi\Desktop\AbadPxl\2-EAI\Project_Onderzoek\Autonomous_Cart\AutonomousCart\RFID_Reader_PSOC.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Abad_Sethi\Desktop\AbadPxl\2-EAI\Project_Onderzoek\Autonomous_Cart\AutonomousCart\RFID_Reader_PSOC.cydsn\RFID_Reader_PSOC.cyprj
# Date: Mon, 30 Mar 2020 13:23:43 GMT
